4_basic_http_authentication_and_partials/app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)

  def edit
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("updated_at", "title", "description", "author_id", "created_at") VALUES('2009-02-18 08:13:05', 'The Audacity of Hope: Thoughts on Reclaiming the American Dream', 'Barack Obama''s first book, Dreams from My Father, was a compelling and moving memoir focusing on personal issues of race, identity, and community. With his second book The Audacity of Hope, Obama engages themes raised in his keynote speech at the 2004 Democratic National Convention, shares personal views on faith and values and offers a vision of the future that involves repairing a "political process that is broken" and restoring a government that has fallen out of touch with the people. We had the opportunity to ask Senator Obama a few questions about writing, reading, and politics--see his responses below. --Daphne Durham', 2, '2009-02-18 08:13:05')

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)
UPDATE "books" SET "author_id" = 4, "updated_at" = '2009-02-18 08:12:26' WHERE "id" = 1